Revit 2024 API
Options Class
User preferences for parsing of geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class Options : APIObject
Visual Basic
Public Class Options _
	Inherits APIObject
Visual C++
public ref class Options : public APIObject
Remarks
This class determines the output of the Element.Geometry property.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Options
See Also
Options Members
Autodesk.Revit.DB Namespace